# Задание со звёздочкой 1
dictionary = {"Имя": ["Андрей", "Кирилл", "Анна", "Евгений", "Евгений", "Александр", "Татьяна", "Аркадий", "Игорь", "Кирилл"],
              "Фамилия": ["Иванов", "Лазарев", "Петрова", "Надобников", "Никитин", "Иванов", "Никитина", "Лихачев", "Никитин", "Левашев"],
              "Город проживания": ["Москва", "Омск", "Псков", "Псков", "Москва", "Псков", "Москва", "Омск", "Псков", "Москва"],
              "Год рождения": [2000, 1987, 2003, 1993, 2001, 2001, 1976, 1957, 1969, 1999],
              "Месяц рождения": [6, 4, 11, 12, 9, 9, 5, 2, 3, 6],
              "Число рождения": [11, 25, 5, 3, 27, 31, 13, 12, 28, 24],
              "Статус": ["Студент", "Работает", "Школьница", "Работает", "Студент", "Студент", "Работает", "Пенсия", "Работает", "Студент"]
              }
# Тут я прохожусь по списку и редактирую данные. Выход нового закона о имени Кирилл. Смерть Аркадия Лихачёва, переезд Никитина.
for i in range(len(dictionary["Имя"])):
    if dictionary["Имя"][i] == "Кирилл":
        dictionary["Имя"][i] = "Кириллл"
    if dictionary["Фамилия"][i] == "Никитин" and dictionary["Город проживания"][i] == "Москва":
        dictionary["Город проживания"][i] = "Махачкала"
    if dictionary["Имя"][i] == "Аркадий" and dictionary["Фамилия"][i] == "Лихачев":
        del dictionary["Имя"][i]
        del dictionary["Фамилия"][i]
        del dictionary["Город проживания"][i]
        del dictionary["Год рождения"][i]
        del dictionary["Месяц рождения"][i]
        del dictionary["Число рождения"][i]
        del dictionary["Статус"][i]
        break

updated_dictionary = {}
# Подготавливаю и вывожу данные для заказчика в нужном формате
for name, surname, city, year, month, day, status in zip(
        dictionary["Имя"],
        dictionary["Фамилия"],
        dictionary["Город проживания"],
        dictionary["Год рождения"],
        dictionary["Месяц рождения"],
        dictionary["Число рождения"],
        dictionary["Статус"]
):
    full_name = f"{surname} {name}"
    birth_date = f"{year}-{month:02d}-{day:02d}"
    updated_dictionary[full_name] = [birth_date, city, status]

print(updated_dictionary)

# Задание 2* Решается кругами эйлера)
set1 = {6, 31, 14, 25, 19, 3, 55}
set2 = {30, 22, 6, 79, 25}
set3 = {9, 1, 22, 19, 30}
# Общее множество
all_set = set1 | set2 | set3
# Пересекающиеся числа в разных множествах, которые стираются при объединении
common_elements = (set1 & set2) | (set1 & set3) | (set2 & set3)

Spisok = all_set - common_elements
print("Разница между всеми элементами множества и не вошедших в него:", Spisok)
